import math
while (1):
    print("=" * 20)
    print("물리공식프로그램에 오신것을 환영합니다.")
    print("1.역학 2. 전자기장  3.파동 4.종료버튼")
    print("=" * 20)
    menu = int(input("input type menu"))

    if menu == 1:
        print("=" * 20)
        print("1단원 역학파트입니다.")
        print("1.등가속도운동 프로그램 2.포물선운동 프로그램 3. 뉴턴의 운동법칙 프로그램 4.돌림힘 계산 프로그램")
        print("5.등속 원운동 계산 프로그램. 6. 단진동 공식 프로그램 7. 만유인력 법칙 프로그램 8. 역학적 에너지 계산 프로그램 ")
        print("=" * 20)
        menu2 = int(input("원하는 부분의 번호를 입력하십시오."))
        if menu2 == 1:
            print("=" * 20)
            print("등가속도 운동 프로그램입니다.")
            v=int(input("처음 속도를 입력하세요. 단위는 m/s입니다."))
            a=int(input("가속도를 입력하세요. 단위는 m/s^2입니다."))
            t=int(input("원하는 운동시간을 입력하십시오. 단위는 초단위입니다."))
            sf=int(v*t+a*t**2/2)
            Vf=int(v+a*t)
            print("%s초에서의 위치는 %sm입니다"%(t,sf))
            print("%s초에서의 속도는 %sm/s입니다"%(t,Vf))
        elif menu2 ==2:
            print("=" * 20)
            print("포물선 운동 계산 프로그램입니다.")
            print("발사속도와 각도를 입력하면 최고점 도달높이, 시간, 수평도달거리를 알려주는 프로그램입니다.")
            g=9.81
            i=int(input("원하는 횟수를 입력하십시오."))
            t1box = []
            hbox = []
            sbox = []
            for a in range(i):

                v1 = float(input("처음 속도를 입력하세요. 단위는 m/s입니다."))
                a1 = float(input("발사각도를 입력하세요."))
                a1 = math.radians(a1)
                C = float(math.sin(a1))
                D = float(math.cos(a1))
                t1 = v1 * C / g
                h = v1 * C * t1 / 2
                s = v1 * D * 2 * t1
                print("이 물체를 %.2fm/s의 속도로 %.2f라디안으로 발사하였을 때 최고점 도달시간은 %.2f초입니다" % (v1,a1,t1))
                print("이 물체를 %.2fm/s의 속도로 %.2f라디안으로 발사하였을 때 최고 높이는 %.2fm입니다" % (v1, a1, h))
                print("이 물체를 %.2fm/s의 속도로 %.2f라디안으로 발사하였을 때 수평도달거리는 %.2fm입니다" % (v1, a1, s))
                t1box.append(t1)
                hbox.append(h)
                sbox.append(s)
                a = a + 1
            print("%s개 각각의 물체의 최고점 도달시간은 %s입니다."%(i,t1box))
            print(i,"개의 각각의 물체의 최고점 최고높이는",hbox,"입니다.")
            print(i,"개의 각각의 물체의 수평도달거리는",sbox,"입니다.")


        elif menu2 ==3:
            print("=" * 20)
            print("뉴턴의 운동법칙 프로그램입니다.")
            print("물체의 질량과 힘을 입력하면 자동으로 전체 가속도를 구해주는 프로그램입니다.")
            i = int(input("원하는 실행횟수를 입력하십시오."))
            if i>=1 and i<=3:
                v = int(input("원하는 물체의 개수를 입력하십시오. 최소 1개에서 3개까지 가능합니다."))
                if v == 1:
                    M = float(input("첫번째 물체의 질량(kg)을 입력하십시오"))
                    F = float(input("외부에서 걸리는 힘(N)을 입력하십시오."))
                    a = F / M
                    print("전체 물체의 가속도는 %.2f입니다" % a)
                elif v == 2:
                    M1 = float(input("첫번째 물체의 질량(kg)을 입력하십시오"))
                    M2 = float(input("두번째 물체의 질량(kg)을 입력하십시오"))
                    F1 = float(input("외부에서 걸리는 힘(N)을 입력하십시오."))
                    a1 = F1 / (M1 + M2)
                    print("전체 물체의 가속도는 %.2f입니다" % a1)
                elif v == 3:
                    Mx1 = float(input("첫번째 물체의 질량(kg)을 입력하십시오"))
                    Mx2 = float(input("두번째 물체의 질량(kg)을 입력하십시오"))
                    Mx3 = float(input("세번째 물체의 질량(kg)을 입력하십시오"))
                    F2 = float(input("외부에서 걸리는 힘(N)을 입력하십시오."))
                    a2 = F2 / (Mx1 + Mx2 + Mx3)
                    print("전체 물체의 가속도는 %.2fm/s^2입니다" % a2)

                else:
                    print("횟수를 잘못입력하였습니다.")
                    break
            else:
                print("횟수를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오")

        elif menu2 ==4:
            print("=" * 20)
            print("돌림힘 계산 프로그램입니다.")
            print("팔의 길이와 힘을 입력하면 자동으로 돌림힘을 구해주는 프로그램입니다.")
            L = float(input("첫번째 팔의 길이m을 입력하십시오"))
            F = float(input("외부에서 걸리는 힘(N)을 입력하십시오."))
            ceta = float(input("팡릥 길이와 힘 사이의 각도를 입력하십시오."))
            a1 = math.radians(ceta)
            C = float(math.sin(a1))
            tork = L * F * C
            print("이 물체의 돌림힘 즉 토크는 %.2f N*m입니다" % tork)

        elif menu2 ==5:
            print("=" * 20)
            print("5.등속 원운동 계산 프로그램입니다")
            print("구심가속도를 구해주는 기능을 원하신다면 1번을 클릭해주십시오.")
            print("구심력을 구해주는 기능을 원하신다면 2번을 클릭해주십시오.")
            c=int(input("select type menu"))
            if c==1:
                R = float(input("원운동의 반지름의 길이m을 입력하십시오"))
                T = float(input("원운동의 주기(s)을 입력하십시오."))
                w=2*3.14/T
                f=1/T
                v=w*R
                a=v*v/R
                print("이 물체의 각속도(rad/s)는 %.2f (rad/s)입니다" %w)
                print("이 물체의 진동수는 %.2f Hz입니다" %f)
                print("이 물체의 선속도는 %.2f m/s입니다" % v)
                print("이 물체의 구심가속도는 %.2f m/s^2입니다" % a)

            elif c==2:
                R = float(input("원운동의 반지름의 길이m을 입력하십시오"))
                T = float(input("원운동의 주기(s)을 입력하십시오."))
                m = float(input("물체의 질량(kg)을 입력하십시오."))
                w = 2 * 3.14 / T
                f = 1 / T
                v = w * R
                a = v * v / R
                F=m*a
                print("이 물체의 각속도(rad/s)는 %.2f (rad/s)입니다" % w)
                print("이 물체의 진동수는 %.2f Hz입니다" % f)
                print("이 물체의 선속도는 %.2f m/s입니다" % v)
                print("이 물체의 구심가속도는 %.2f m/s^2입니다" % a)
                print("이 물체의 구심력은 %.2f N입니다" % F)

            else:
                print("메뉴 번호를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")

        elif menu2 ==6:
            print("=" * 20)
            print(" 6. 단진동 공식 프로그램입니다 ")
            print("=" * 20)
            print(" 단진자와 용수철진자, 원뿔진자의 주기를 구해주는 프로그램입니다.")
            print("단진자의 주기를 구해주는 기능을 원하신다면 1번을 클릭해주십시오.")
            print("용수철진자의 주기를 구해주는 기능을 원하신다면 2번을 클릭해주십시오.")
            print("원뿔진자의 주기를 구해주는 기능을 원하신다면 3번을 클릭해주십시오.")
            g=9.81
            c = int(input("select type menu"))
            if c == 1:
                l = float(input("단진자의 줄의 길이를 입력하십시오"))
                k=((l/g)**(1/2))
                T = 2 * 3.14*k
                print("이 단진자의 주기는 %.2f(/s)입니다" %T)
            elif c==2:
                M= float(input("용수철 진자에 달려있는 물체의 무개(kg)를 입력하십시오"))
                K= float(input("용수철 진자의 용수철 상수(N/m)를 입력하십시오"))
                k1 = ((M / K) ** (1 / 2))
                T1 = 2 * 3.14 * k1
                print("이 용수철진자의 주기는 %.2f(/s)입니다" % T1)
            elif c==3:
                h = float(input("원뿔진자의 높이를 입력하십시오"))
                k2 = ((h / g) ** (1 / 2))
                T2 = 2 * 3.14 * k2
                print("이 원뿔진자의 주기는 %.2f(/s)입니다" % T2)
            else:
                print("메뉴 번호를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")

        elif menu2 ==7:
            print("=" * 20)
            print("7. 만유인력 법칙 프로그램입니다 ")
            print("두 행성의 질량과 거리를 입력하면 두 행성 사이의 만유인력을 계산해주는 프로그램입니다.")
            M1 = float(input("첫번째 행성의 무개[kg]를 입력하십시오"))
            M2 = float(input("두번째 행성의 무개[kg]를 입력하십시오"))
            Rr = float(input("두 행성 사이의 거리[m]를 입력하십시오"))
            Fg=6.67384*M1*M2/(Rr**2)*(10**11)
            print("두 행성 사이의 만유인력의 크기는 %.2f[N]입니다" %Fg)
            E=int(input("만약 등속 원운동하는 인공위성의 회전속도를 알고싶다면 1번을 눌러주십시오."))
            if E==1:
                print("등속 원운동하는 인공위성의 회전속도를 계산하겠습니다.")
                G = 6.67384 * (1 / 10**11)
                M1 = float(input("행성의 무개(kg)를 입력하십시오"))
                Rr1 = float(input("행성과 인공위성 사이의 거리(m)를 입력하십시오"))
                print("만유인력이 구심력의 역할을 하는 것을 이용하면 됩니다.")
                v=((6.67384*M1/Rr1)/(10**11))**(1/2)
                print("인공위성의 회전속도의 크기는 %.2f(m/s)입니다" %v)
            else:
                print("메뉴 번호를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")




    elif menu == 2:
        print("=" * 20)
        print("2단원 전자기장 파트입니다.")
        print("1.전기력 계산 프로그램 2. 옴의 법칙 계산 프로그램 3. 축전기 계산 프로그램 ")
        print("=" * 20)

        menu4 = int(input("원하는 부분의 번호를 입력하십시오."))
        if menu4 == 1:
            print("=" * 20)
            print("1.전기력 계산 프로그램입니다. ")
            q1 = float(input("첫번째 전하의 전하량(C)을 입력하십시오"))
            q2 = float(input("두번째 전하의 전하량(C)을 입력하십시오"))
            r0 = float(input("두 전하 사이의 거리(m)를 입력하십시오"))
            k=9*(10**9)
            Fq = k * q1 * q2 / (r0 ** 2)
            print("두 전하 사이의 전기력의 크기는 %.2f[N]입니다" % Fq)
            print("=" * 20)
            c=int(input("만약 추가로 전기장의 세기E를 알고 싶으시면 1번을 클릭해주십시오."))
            D=Fq/q1
            E=Fq/q2
            if c==1:
                print("q2에 의한 전기장의 크기는 %.2f[N]입니다" % D)
                print("q1에 의한 전기장의 크기는 %.2f[N]입니다" % E)
            else:
                print("메뉴 번호를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")


        elif menu4 == 2:
            print("=" * 20)
            print("2. 옴의 법칙 계산 프로그램입니다.")
            print("옴의 법칙이란 V=IR을 이야기합니다.")
            print("아래에 보이는 원하는 메뉴에 해당하는 번호를 선택해주십시오.")
            type1=int(input("1.직렬 2.병렬 "))
            if type1==1:
                print("직렬일때 옴의 법칙 계산 프로그램입니다.")
                X=int(input("원하는 저항의 개수를 입력하세요. 1~4개 까지만 가능합니다."))
                if X==1:
                    print("직렬회로의 개수가 1개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1= float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    I=V/R1
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X==2:
                    print("직렬회로의 개수가 2개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    I = V / (R1+R2)
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X==3:
                    print("직렬회로의 개수가 3개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    R3 = float(input(" 세번째 저항의 크기를 입력하십시오"))
                    I = V / (R1 + R2 + R3)
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X==4:
                    print("직렬회로의 개수가 4개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    R3 = float(input(" 세번째 저항의 크기를 입력하십시오"))
                    R4 = float(input(" 네번째 저항의 크기를 입력하십시오"))
                    I = V / (R1 + R2+ R3 + R4)
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                else:
                    print("회로의 개수를 잘못입력하셨습니다.")
                    print("처음부터 다시 이용해 주십시오.")

            elif type1==2:
                print("병렬일때 옴의 법칙 계산 프로그램입니다.")
                X = int(input("원하는 저항의 개수를 입력하세요. 1~4개 까지만 가능합니다."))
                if X == 1:
                    print("병렬회로의 개수가 1개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    I = V / R1
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X == 2:
                    print("병렬회로의 개수가 2개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    I = V / (R1*R2/(R1 + R2))
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X == 3:
                    print("병렬회로의 개수가 3개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    R3 = float(input(" 세번째 저항의 크기를 입력하십시오"))
                    I = V*((R1*R2)+(R1*R3)+(R2*R3))/(R1*R2*R3)
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)
                elif X == 4:
                    print("병렬회로의 개수가 4개일 때 회로에 흐르는 전류를 계산하겠습니다.")
                    V = float(input(" 회로 전체에 걸리는 전압[V]를 입력하십시오"))
                    R1 = float(input(" 첫번째 저항의 크기를 입력하십시오"))
                    R2 = float(input(" 두번째 저항의 크기를 입력하십시오"))
                    R3 = float(input(" 세번째 저항의 크기를 입력하십시오"))
                    R4 = float(input(" 네번째 저항의 크기를 입력하십시오"))

                    I = V * ((R1 * R2* R3) + (R2 * R3 *R4) + (R3 * R4 * R1) +(R1*R2*R4)) / (R1 * R2 * R3* R4)
                    print("이 회로에 걸리는 전류의 세기는  %.2f[A]입니다" % I)


                else:
                    print("회로의 개수를 잘못입력하셨습니다.")
                    print("처음부터 다시 이용해 주십시오.")
            else:
                print("메뉴를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")



        elif menu4 == 3:
            print("=" * 20)
            print("3. 축전기 계산 프로그램입니다. ")
            print("축전기의 전기용량을 입력하면 총 전기용량을 계산해주는 기능이 있습니다.")
            type1 = int(input("1.직렬 2.병렬 "))
            if type1 == 1:
                print("직렬일때 축전기의 전기용량 계산 프로그램입니다.")
                Y= int(input("원하는 축전기의 개수를 입력하세요. 1~4개 까지만 가능합니다."))
                if Y == 1:
                    print("축전기의 개수가 1개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = C1
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 2:
                    print("축전기의 개수가 2개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = (C1 * C2 / (C1 + C2))
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 3:
                    print("축전기의 개수가 3개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C3 = float(input(" 세번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = (C1 * C2 * C3)/((C1 * C2) + (C1 * C3) + (C2 * C3))
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 4:
                    print("축전기의 개수가 4개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C3 = float(input(" 세번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C4 = float(input(" 네번째 축전기의 전기용량의 크기를 입력하십시오"))

                    I = (C1 * C2 * C3 * C4)/((C1 * C2 * C3) + (C2 * C3 * C4) + (C3 * C4 * C1) + (C1 * C2 * C4))
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)

                else:
                    print("회로의 개수를 잘못입력하셨습니다.")
                    print("처음부터 다시 이용해 주십시오.")


            elif type1 == 2:
                print("병렬일때 축전기의 전기용량 계산 프로그램입니다.")
                Y = int(input("원하는 축전기의 개수를 입력하세요. 1~4개 까지만 가능합니다."))
                if Y == 1:
                    print("축전기의 개수가 1개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = C1
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 2:
                    print("축전기의 개수가 2개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = C1 + C2
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 3:
                    print("축전기의 개수가 3개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C3 = float(input(" 세번째 축전기의 전기용량의 크기를 입력하십시오"))
                    I = (C1 + C2 + C3)
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)
                elif Y == 4:
                    print("축전기의 개수가 4개일 때 총 전기용량를 계산하겠습니다.")
                    C1 = float(input(" 첫번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C2 = float(input(" 두번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C3 = float(input(" 세번째 축전기의 전기용량의 크기를 입력하십시오"))
                    C4 = float(input(" 네번째 축전기의 전기용량의 크기를 입력하십시오"))

                    I = (C1 + C2 + C3 + C4)
                    print("이 회로에서 총 전기용량의 크기는  %.2f[F]입니다" % I)

                else:
                    print("회로의 개수를 잘못입력하셨습니다.")
                    print("처음부터 다시 이용해 주십시오.")

            else:
                print("메뉴를 잘못입력하셨습니다.")
                print("처음부터 다시 이용해 주십시오.")

        else:
            print("메뉴 번호를 잘못입력하셨습니다.")
            print("처음부터 다시 이용해 주십시오.")


    elif menu == 3:
        print("=" * 20)
        print("3단원 파동파트입니다.")
        print("1.렌즈 배율 계산기 프로그램")
        print("=" * 20)

        menu4 = int(input("원하는 부분의 번호를 입력하십시오."))
        if menu4 == 1:
            print("=" * 20)
            D = 25
            a = 0
            print("환영합니다 렌즈 배율 계산기 프로그램입니다.")

            while (True):
                print("1번 메뉴를 클릭하시면 배율 계산을 시작합니다. 2번 메뉴를 클릭하시면 종료합니다.")
                c = int(input("원하는 메뉴에 해당하는 숫자를 입력하십시오. "))
                if c == 1:
                    print("=" * 100)
                    print("-------------------------" * 5)
                    print("대물렌즈의 배율은 경통길이를 초점의 길이로 나누면 됩니다")
                    print("대안렌즈의 배율은 명시거리를 초점의 길이로 나누면 됩니다")
                    print("현미경의 배율은 대물렌즈의 배율과 대안렌저의 배율의 곱입니다.")
                    print("=" * 100)
                    print("-------------------------" * 5)
                    i = int(input("원하는 계산 횟수를 입력하십시오"))
                    Mabox = []
                    Mbbox = []
                    Mbox = []
                    while (True):
                        if a < i:
                            print("-------------------------" * 5)
                            print("%d번째 현미경의 배율계산입니다." % (a + 1))
                            L = float(input("2.곁통 길이를 입력하십시오.<18~30사이>"))
                            f1 = float(input("3.대물렌즈의 초점길이를 입력하십시오"))
                            f2 = float(input("3.대안렌즈의 초점길이를 입력하십시오"))
                            Ma = int(L / f1)
                            print("=" * 100)
                            print("-------------------------" * 5)
                            print(" %d번째 입력받은 대물렌즈의 배율은 %d입니다" % (a + 1, Ma))
                            Mabox.append(Ma)
                            Mb = int(D / f2)
                            print("=" * 100)
                            print("-------------------------" * 5)
                            print("%d번째 입력받은 대물렌즈의 배율은 %d입니다" % (a + 1, Mb))
                            Mbbox.append(Mb)
                            M = int(Ma * Mb)
                            print("=" * 100)
                            print("-------------------------" * 5)
                            print("%d번째 입력받은 현미경의 배율은 %d입니다" % (a + 1, M))
                            Mbox.append(M)
                            a = a + 1
                        else:
                            print("=" * 100)
                            print("-------------------------" * 5)
                            print("계산을 마치겠습니다. 수고하셨습니다.")
                            print("=" * 100)
                            print(" 대물렌즈의 배율은 각각 순서대로 아래와 같이 나타나있습니다")
                            print(Mabox)
                            print("=" * 100)
                            print(" 대안렌즈의 배율은 각각 순서대로 아래와 같이 나타나있습니다")
                            print("=" * 100)
                            print(Mbbox)
                            print("=" * 100)
                            print(" 현미경의 배율은 각각 순서대로 아래와 같이 나타나있습니다")
                            print(Mbox)
                            break

                else:
                    print("-------------------------" * 5)
                    print("프로그램을 종료하겠습니다.")
                    break

    else:
        print("프로그램을 종료하겠습니다.")
        break